backend/app/models/user.rb

  def self.generate_token
    token = SecureRandom.uuid
    if User.exists?(token: token)
---
SELECT  1 AS one FROM "users" WHERE "users"."token" = $1 LIMIT $2  [["token", "43001a08-78a8-44d0-9c61-0b935808f638"], ["LIMIT", 1]]