backend/app/controllers/reservations_controller.rb

  def create
    reservation = Reservation.new(params_permit)
    if reservation.valid?
      reservation.save
---
INSERT INTO "reservations" ("user_id", "room_id", "date_begin", "date_end", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["room_id", 1], ["date_begin", "2018-07-12"], ["date_end", "2018-07-06"], ["created_at", "2018-07-20 18:02:22.767878"], ["updated_at", "2018-07-20 18:02:22.767878"]]

  def show
    render json: {reservation: Reservation.find(params[:id]).as_json( include: [user: {only: :email}, room: { include: {type_room: {}}}]), status: 201}
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def update
    reservation = Reservation.find(params[:id])
    render json: {reservation: Reservation.update(reservation.id, params_permit).as_json( include: [user: {only: :email}, room: { include: {type_room: {}}}]), status: 201}
---
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "reservations" SET "date_begin" = $1, "updated_at" = $2 WHERE "reservations"."id" = $3  [["date_begin", "2017-01-29"], ["updated_at", "2018-07-20 18:30:57.420887"], ["id", 4]]

  def destroy
    reservation = Reservation.find(params[:id]).destroy
---
DELETE FROM "reservations" WHERE "reservations"."id" = $1  [["id", 4]]
SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def index
    render json: {reservations: Reservation.all.as_json( include: [user: {only: :email}, room: { include: {type_room: {}}}]), status: 201}
---
SELECT "reservations".* FROM "reservations"

  def verify_token
    if !User.exists?(token: params[:token])
---
SELECT  1 AS one FROM "users" WHERE "users"."token" = $1 LIMIT $2  [["token", "09877be1-5287-458a-9616-ff0881de5cea"], ["LIMIT", 1]]

  def verify_reservation
    if !Reservation.exists?(params[:id])
---
SELECT "reservations".* FROM "reservations"