backend/app/controllers/rooms_controller.rb

  def create
    room = Room.new(params_permit)
    if room.valid?
      room.save
---
INSERT INTO "rooms" ("created_at", "updated_at", "type_room_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2018-07-18 20:21:46.504279"], ["updated_at", "2018-07-18 20:21:46.504279"], ["type_room_id", 1]]

  def index
    render json: {room: Room.all.as_json( include: :type_room ), status: 201}
---
SELECT "rooms".* FROM "rooms"