backend/app/controllers/type_rooms_controller.rb

INSERT INTO "type_rooms" ("price", "created_at", "updated_at", "name") VALUES ($1, $2, $3, $4) RETURNING "id"  [["price", "25000"], ["created_at", "2018-07-18 20:13:49.508656"], ["updated_at", "2018-07-18 20:13:49.508656"], ["name", 0]]
---
  def create
    type_room = TypeRoom.new(params_permit)
    if type_room.valid?
      type_room.save

SELECT "type_rooms".* FROM "type_rooms"
---
  def index
    render json: {type_rooms: TypeRoom.all, status: 201}