app/controllers/users_controller.rb

  def create
    user = User.new(params_permit)
    if user.valid?
      if !User.exists?(email: params[:email])
        user.password = Digest::MD5.hexdigest(params[:password].to_s)
        user.token = User.generate_token
        user.save
---
SELECT  1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "castrodaniel244@gmail.com"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "password", "token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def validate_login
    if User.exists?(email: params[:email])
      user = User.find_by(email: params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "castrodaniel244@gmail.com"], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "castrodaniel2444@gmail.com"], ["LIMIT", 1]]